---
kind: other
id: Methods.T:Autodesk.Revit.DB.StartingViewSettings
source: html/053eb7ff-238b-5bc4-7ccb-194d12499b9b.htm
---
# StartingViewSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.